In [75]:
%matplotlib inline
import matplotlib
import seaborn as sns
import pandas as pd
import missingno as msno
import numpy as np
sns.set(style="white")
matplotlib.rc('figure', figsize=[12, 5])

In [76]:
data = pd.read_csv('us.1969_2017.19ages.adjusted.txt', header=None)
data.columns = ["blob"]
data.head()

                         blob
0  1969AL01001991910000000159
1  1969AL01001991910100000657
2  1969AL01001991910200001137
3  1969AL01001991910300000956
4  1969AL01001991910400000721

In [77]:
data.dtypes

blob    object
dtype: object

In [78]:
data['blob'] = data['blob'].astype('str') 
data.dtypes

blob    object
dtype: object

In [79]:
data_tf = pd.DataFrame(columns=['Year','State','Race','Origin','Sex','Age','Population'])
data_tf.columns

Index(['Year', 'State', 'Race', 'Origin', 'Sex', 'Age', 'Population'], dtype='object')

In [80]:
data_tf['Year'] = data.blob.str.slice(0,4)
data_tf['State'] = data.blob.str.slice(4,6)
data_tf['Race'] = data.blob.str.slice(13,14)
data_tf['Origin'] = data.blob.str.slice(14,15)
data_tf['Sex'] = data.blob.str.slice(15,16)
data_tf['Age'] = data.blob.str.slice(16,18)
data_tf['Population'] = data.blob.str.slice(18,26)
data_tf.head()

   Year State Race Origin Sex Age Population
0  1969    AL    1      9   1  00   00000159
1  1969    AL    1      9   1  01   00000657
2  1969    AL    1      9   1  02   00001137
3  1969    AL    1      9   1  03   00000956
4  1969    AL    1      9   1  04   00000721

In [81]:
data_tf.dtypes

Year          object
State         object
Race          object
Origin        object
Sex           object
Age           object
Population    object
dtype: object

In [82]:
data_tf['Year'] = data_tf['Year'].astype('int')
data_tf['State'] = data_tf['State'].astype('str')
data_tf['Race'] = data_tf['Race'].astype('int')
data_tf['Origin'] = data_tf['Origin'].astype('int')
data_tf['Sex'] = data_tf['Sex'].astype('int')
data_tf['Age'] = data_tf['Age'].astype('int')
data_tf['Population'] = data_tf['Population'].astype('int')
data_tf.dtypes

Year           int64
State         object
Race           int64
Origin         int64
Sex            int64
Age            int64
Population     int64
dtype: object

In [83]:
data_tf.head()

   Year State  Race  Origin  Sex  Age  Population
0  1969    AL     1       9    1    0         159
1  1969    AL     1       9    1    1         657
2  1969    AL     1       9    1    2        1137
3  1969    AL     1       9    1    3         956
4  1969    AL     1       9    1    4         721

In [88]:
years = [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]

data_tf_2005_15 = data_tf[data_tf.Year.isin(years)]

data_tf_2005_15.head()

          Year State  Race  Origin  Sex  Age  Population
10271262  2005    AL     1       9    1    0         262
10271263  2005    AL     1       9    1    1        1082
10271264  2005    AL     1       9    1    2        1459
10271265  2005    AL     1       9    1    3        1683
10271266  2005    AL     1       9    1    4        1621

In [99]:
#state = ['IN', 'KY', 'MI', 'OH', 'PA', 'WV']
#data_tf_2005_15_st = data_tf_2005_15[data_tf_2005_15.State.isin(state)]
#data_tf_2005_15_st.head()

          Year State  Race  Origin  Sex  Age  Population
10344282  2005    IN     1       9    1    0         320
10344283  2005    IN     1       9    1    1        1169
10344284  2005    IN     1       9    1    2        1329
10344285  2005    IN     1       9    1    3        1596
10344286  2005    IN     1       9    1    4        1397

In [101]:
data_sum = data_tf_2005_15_st.groupby(['Year', 'State', 'Age'])
data_sum1["Tot Population"] = data_sum['Population'].sum()

data_sum1

Year            State  Age
2005            IN     0       85050
                       1      344567
                       2      432642
                       3      454815
                       4      463181
                       5      453312
                       6      402016
                       7      409729
                       8      424857
                       9      475312
                       10     477254
                       11     430584
                       12     370561
                       13     278475
                       14     217506
                       15     180098
                       16     159467
                       17     119499
                       18      99691
                KY     0       55364
                       1      217298
                       2      271115
                       3      286751
                       4      288741
                       5      298829
                       6      273526
                       7      280989
                       8      289885
                       9      319475
                       10     320751
                               ...
2015            PA     9      757085
                       10     839482
                       11     930386
                       12     950625
                       13     839873
                       14     696151
                       15     499281
                       16     366729
                       17     282462
                       18     333264
                WV     0       19934
                       1       82031
                       2      104219
                       3      106160
                       4      110235
                       5      122065
                       6      109825
                       7      107110
                       8      111411
                       9      115152
                       10     117961
                       11     128442
                       12     137038
                       13     131267
                       14     116063
                       15      81138
                       16      59254
                       17      40403
                       18      40059
Tot Population                   NaN
Name: Population, Length: 1255, dtype: object

In [91]:
data_sum2 = data_tf_2005_15_st.groupby(['Year', 'State'])['Population'].sum()
data_sum2.columns=['Year', 'State', 'Tot Population']
data_sum2

Year  State
2005  IN        6278616
      KY        4182742
      MI       10051137
      OH       11463320
      PA       12449990
      WV        1820492
2006  IN        6332669
      KY        4219239
      MI       10036081
      OH       11481213
      PA       12510809
      WV        1827912
2007  IN        6379599
      KY        4256672
      MI       10001284
      OH       11500468
      PA       12563937
      WV        1834052
2008  IN        6424806
      KY        4289878
      MI        9946889
      OH       11515391
      PA       12612285
      WV        1840310
2009  IN        6459325
      KY        4317074
      MI        9901591
      OH       11528896
      PA       12666858
      WV        1847775
                 ...
2011  IN        6515358
      KY        4368505
      MI        9876199
      OH       11543332
      PA       12742811
      WV        1854891
2012  IN        6535665
      KY        4383673
      MI        9886610
      OH       11546969
      PA       12768034
      WV        1855360
2013  IN        6567484
      KY        4399121
      MI        9899219
      OH       11567845
      PA       12778450
      WV        1852333
2014  IN        6593182
      KY        4410415
      MI        9914675
      OH       11593741
      PA       12790341
      WV        1847624
2015  IN        6610596
      KY        4422057
      MI        9918170
      OH       11606027
      PA       12791124
      WV        1839767
Name: Population, Length: 66, dtype: int64